# #算术运算符：+、-、*、/、//、%、**
# #分别对应：加、减、乘、除、取余、幂指数
# print("10 + 4 = ", 10 + 4)#加
# print("10 - 4 = ", 10 - 4)#减
# print("10 * 4 = ", 10 * 4)#乘
# print("10 / 4 = ", 10 / 4)#除:2.5
# print("10 // 4 = ", 10 // 4)#整除:2(整除的结果是整数)
# print("10 % 4 = ", 10 % 4)#取余：10除以4余2
# print("10 ** 4 = ", 10 ** 4)#幂指数

# #算数运算符的优先级----->  ** -->  * / // %-->  + -
# #                        1         2          3
# print("0.1 + 10 / 4 ** 2 =", 0.1 + 10 / 4 ** 2)

#案例：要求输入两个数 x 与 y ，分别输出 x + y 的结果和 x - y 的结果。

# x = input("请输入第一个数x:")
# y = input("请输入第二个数y:")
# #请输入第一个数x:0.6
# #请输入第二个数y:2.8
# # x + y =  3.4
# # x - y =  -2.1999999999999997
# # x * y =  1.68
# #出现上面的情况—————>算数运算的精度损失；由于计算机底层是基于 二进制 进行数据的存储与处理，二进制是无法准确的表示所有的小数的，因此涉及到浮点数的运算，可能会损失精度。
# print("x + y = ",float(x)+float(y))
# print("x - y = ",float(x)-float(y))
# print("x * y = ",float(x)*float(y))

# # 赋值运算符：= += -+ *= /+ %= //+ **=
#
# num = 85
#
# num += 10
# print("num +=",num)
#
# num -= 10
# print("num -=",num)
#
# num *= 10
# print("num *=",num)
#
# num /= 10
# print("num /= 10",num)
#
# num //= 10
# print("num //=",num)
#
# num %= 3
# print("num %=",num)
#
# num **= 3
# print("num **=",num)


# 比较运算符：== != > >= < <=
# print("100 == 100 吗",100 == 100)
# print("'100' == '100' 吗",'100' == '100')
# print("100 != 100 吗",100 != 100)
#
# print("100 < 100 吗",100 < 100)
# print("100 <= 100 吗",100 <= 100)
#
# print("100 > 100 吗",100 > 100)
# print("100 >= 100 吗",100 >= 100)

# 案例：思考如下需求需要用到那种比较运算符
#1.数学计算中，判断一个数是否为偶数
#2.电商项目的支付业务，判断银行卡余额是否足够
#3.电商项目的购买业务，判断货物的库存是否足够
#4.点餐项目的商品筛选业务，需要点不超过一百元的
#1.num % 2 == 0    2.>=    3.>=     4.<=

#案例：基于逻辑运算符完成如下需求
#需求1.键盘输入一个整数，判断这个整数是否在10-20之间
#需求2.键盘输入一个整数，判断这个整数是否不在10-20之间
# 1
num = input("请输入一个整数：")
print("是否在10-20之间？", 10 <= int(num) <= 20)#and连接的是并且的关系，同时成立才是True，否者是False
num = input("请再输入一个整数：")#一True则True
print("是否不在10-20之间？",int(num) > 20 or int(num) < 10)