#三角形类型判断：根据输入的三个边的边长（正整数），请判断三角形类型：等边、等腰、普通、还是不能构成三角形
# side1 = int(input("请输入第1条边的长度（正整数）："))
# side2 = int(input("请输入第2条边的长度（正整数）："))
# side3 = int(input("请输入第3条边的长度（正整数）："))
# if side1 + side2 > side3 and side1 + side3 > side2 and side2 + side3 > side1:
#     if side1 == side3 == side2:
#         print("是等边三角形")
#     elif side1 == side2 or side1 == side3 or side2 == side3:
#         print("是等腰三角形")
#     else:
#         print("是普通三角形")
# else:
#     print("该三条边不能构成一个三角形")

"""
作业：北京市居民年年度用电电费计算：根据输入的用电数，计算电费
北京市剧名采用阶梯电价计价方式，所谓阶梯电价是指按照用户消费的电量进行分段定价，用电价格随用电量逐级增加呈阶梯状
阶梯电价规则：
第一档：2880度以下电费单价0.4883
第二档：2880到4800，0.5383
第三档：4800以上，0.7883
"""
elc = int(input("请输入用电量（度）："))
if elc < 2880:
    print("您的电费为：",elc * 0.4883)
elif 2880 <= elc < 4800:
    print("您的电费为：",2880 * 0.4883 + (elc - 2880) * 0.5383)
else:
    print("您的电费为：",2880 * 0.4883 + (4800 - 2880) * 0.5383 + (elc - 4800) * 0.7883)
